{
    "client": "eHarmony, Inc.",
    "info": [
        {
            "title": "Registration",
            "text": "The Registration page is the default landing page of the website and serves as the main entry point for new users into the company's core dating product. Since this page is critical to conversion metrics, it is one of the most highly tested pages on the website."
        },
        {
            "title": "Relationship Questionnaire",
            "text": "Better known as the R.Q., this feature is where the company assesses its users with an in-depth survey which covers everything from basic personal preferences to complex compatibility analysis. The answers are plugged into a series of complex matching algorithms that leverage eHarmony's patented 29 dimensions of compatibility to determine a pool of compatible matches."
        },
        {
            "title": "Subscription",
            "text": "The Subscription page represents the bottom of the conversion funnel and is where active users become subscribers. The entire flow is comprised of three pages: 1.) Plan Selection, 2.) Billing, and 3. Congratulations. A custom A/B...N Testing framework sits on top of the main Subscription codebase and is responsible for conducting various user-interface tests aimed at increasing key conversion metrics."
        },
        {
            "title": "Dashboard",
            "text": "The Dashboard feature is an aggregation layer which compiles all of your compatible matches' website activity into one long newsfeed page. The various newsfeed items include: page views notifications, profile page updates, photo uploads, and user-initiated communication."
        },
        {
            "title": "Matches",
            "text": "The Match Listing feature is the most visited module on the site. This gallery view presents users with a complete list of their compatible matches and a series of filters for sorting and grouping matches into specific categories. A handful of new compatible matches are added to the site each day and previous matches are lazy-loaded as a user scrolls down the page."
        },
        {
            "title": "Match Profile (onload)",
            "text": "Once a user clicks on a compatible match, they will be taken to the Match Profile feature. The profile page is where users can learn more about their matches. The opening view shows the selected matche's profile photo and details superficial information such as age, height, location, occupation, and more."
        },
        {
            "title": "Match Profile (onscroll)",
            "text": "The feature is designed to present information organized in a similar fashion to how a relationship would organically develop over time. First, you are presented with a visual followed by superficial background information such as ethnicity and height, then as you scroll down the page you begin to learn more detailed information about the person. Important navigation controls are fixed at the top and bottom of the page to allow easy traversing between other matches and useful features like Communication and the Match Listing gallery."
        },
        {
            "title": "What If?",
            "text": "The What If? feature is where eHarmony's matching algorithms are used to identify compatible matches that fall just outside of a user's preferences. Despite what you may have selected as your primary preference regarding distance or age, we think this person offers a lot of potential should a user choose to relax their settings and role the dice."
        },
        {
            "title": "Communication",
            "text": "The Comm feature is where users can communicate with their compatible matches. The product is broken into two primary components: 1.) Guided Comm, which allows users to step through a series of pre-selected questions and answers, and 2.) Open Comm, which allows users to communicate freely with users (similar to email or instant messaging)."
        },
        {
            "title": "More Menu",
            "text": "Part of the main navigation, the more menu serves as an overflow page for non-essential website tasks such as editing the user's profile, settings, or logging out. This page solves a number of real-estate constraints associated with the mobile website and allows the navigation to scale as necessary."
        },
        {
            "title": "Settings",
            "text": "The Settings feature allows users to edit important match settings and account-related information. Some of the most common use cases are residential location, occupation, and common user preferences like pets, drinking, children, etc. Most of the editable information found in the settings page was from data answered during the R.Q."
        }
    ],
    "project": "Mobile Web Application",
    "technology": "HTML, CSS, JavaScript"
}